_test_documents/56/siu-update-status-request-56.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:smev="http://smev.gosuslugi.ru/rev120315" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><SOAP-ENV:Header><wsse:Security SOAP-ENV:actor="http://smev.gosuslugi.ru/actors/smev" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="CertId">MIII4zCCCJKgAwIBAgIKGm/WPQAAAAABVDAIBgYqhQMCAgMwggGCMRswGQYJKoZIhvcNAQkBFgx1
Y0BlZGl3ZWIucnUxGDAWBgUqhQNkARINMTA4OTg0NzIyMzk2MDEaMBgGCCqFAwOBAwEBEgwwMDc4
MDE0NzEwODIxUjBQBgNVBAkMSTE5OTE3OCDQvdCw0LEuINCg0LXQutC4INCh0LzQvtC70LXQvdC6
0Lgg0LTQvtC8IDE0INC70LjRgi7QkCDQvtGE0LjRgSAzODcxMDAuBgNVBAsMJ9Cj0LTQvtGB0YLQ
vtCy0LXRgNGP0Y7RidC40Lkg0YbQtdC90YLRgDEgMB4GA1UECgwX0J7QntCeICLQrdC00LjRgdC+
0YTRgiIxJjAkBgNVBAcMHdCh0LDQvdC60YIt0J/QtdGC0LXRgNCx0YPRgNCzMSkwJwYDVQQIDCA3
OCDQodCw0L3QutGCLdCf0LXRgtC10YDQsdGD0YDQszELMAkGA1UEBhMCUlUxJTAjBgNVBAMMHNCj
0KYg0J7QntCeICLQrdC00LjRgdC+0YTRgiIwHhcNMTQxMTA1MTEzODAwWhcNMTUxMTA1MTE0ODAw
WjCCAf0xFjAUBgUqhQNkAxILMDA3NjE2Nzg5NTkxGDAWBgUqhQNkARINMTEzNzg0NzE2ODY3ODEa
MBgGCCqFAwOBAwEBEgwwMDc4MDQ1MDc3MzExHTAbBgkqhkiG9w0BCQEWDmFydEB3ZWJkb20ubmV0
MQswCQYDVQQGEwJSVTEtMCsGA1UECB4kADcAOAAgBCEEMAQ9BDoEQgAtBB8ENQRCBDUEQAQxBEME
QAQzMScwJQYDVQQHHh4EIQQwBD0EOgRCAC0EHwQ1BEIENQRABDEEQwRABDMxJTAjBgNVBAoeHAQe
BB4EHgAgACcAJwQSBDUEMQQ0BD4EPAAnACcxIzAhBgNVBAseGgQQBDQEPAQ4BD0EOARBBEIEQAQw
BEYEOARPMSUwIwYDVQQDHhwEHgQeBB4AIAAnACcEEgQ1BDEENAQ+BDwAJwAnMTswOQYDVQQJHjIE
HwRABD4EQQQ/BDUEOgRCACAEHwRABD4EQQQyBDUESQQ1BD0EOARPACwAIAA4ADUEEDExMC8GA1UE
DB4oBBMENQQ9BDUEQAQwBDsETAQ9BEsEOQAgBDQEOARABDUEOgRCBD4EQDErMCkGA1UEKh4iBBQE
PAQ4BEIEQAQ4BDkAIAQhBDUEQAQzBDUENQQyBDgERzEZMBcGA1UEBB4QBBUEQAQ8BD4EOwQwBDUE
MjBjMBwGBiqFAwICEzASBgcqhQMCAiQABgcqhQMCAh4BA0MABEA6I2luBWe2i7DR3oszuulF2Ckm
yqIIxkQediw536hdMPDJDZ+PQWDdFVVNAuHjqZMBxNcE5e0CHeXj4EpSHC0Wo4IEZzCCBGMwDgYD
VR0PAQH/BAQDAgTwMBkGCSqGSIb3DQEJDwQMMAowCAYGKoUDAgIVMCYGA1UdJQQfMB0GCCsGAQUF
BwMEBgcqhQMCAiIGBggrBgEFBQcDAjAdBgNVHQ4EFgQUm9eFaAMZ4q45tnUTtFez4jAVpiMwggHD
BgNVHSMEggG6MIIBtoAU38SdITs8CfCl8FiUKxekLWA/RhOhggGKpIIBhjCCAYIxGzAZBgkqhkiG
9w0BCQEWDHVjQGVkaXdlYi5ydTEYMBYGBSqFA2QBEg0xMDg5ODQ3MjIzOTYwMRowGAYIKoUDA4ED
AQESDDAwNzgwMTQ3MTA4MjFSMFAGA1UECQxJMTk5MTc4INC90LDQsS4g0KDQtdC60Lgg0KHQvNC+
0LvQtdC90LrQuCDQtNC+0LwgMTQg0LvQuNGCLtCQINC+0YTQuNGBIDM4NzEwMC4GA1UECwwn0KPQ
tNC+0YHRgtC+0LLQtdGA0Y/RjtGJ0LjQuSDRhtC10L3RgtGAMSAwHgYDVQQKDBfQntCe0J4gItCt
0LTQuNGB0L7RhNGCIjEmMCQGA1UEBwwd0KHQsNC90LrRgi3Qn9C10YLQtdGA0LHRg9GA0LMxKTAn
BgNVBAgMIDc4INCh0LDQvdC60YIt0J/QtdGC0LXRgNCx0YPRgNCzMQswCQYDVQQGEwJSVTElMCMG
A1UEAwwc0KPQpiDQntCe0J4gItCt0LTQuNGB0L7RhNGCIoIQPt8m9z5jwJpAz4jmCkkW6zBdBgNV
HR8EVjBUMFKgUKBOhkxodHRwOi8vZWRpd2ViLnJ1L2luZGV4LnBocC9ydS9vZmZlcnMvY2EvY2Vy
dGlmaWNhdGUvY3JsL2VkaXNvZnRxdWFsLTIwMTMuY3JsMGkGCCsGAQUFBwEBBF0wWzBZBggrBgEF
BQcwAoZNaHR0cDovL2VkaXdlYi5ydS9pbmRleC5waHAvcnUvb2ZmZXJzL2NhL2NlcnRpZmljYXRl
L3Jvb3QvZWRpc29mdHF1YWwtMjAxMy5jcnQwKwYDVR0QBCQwIoAPMjAxNDExMDUxMTM4MDBagQ8y
MDE1MTEwNTExMzgwMFowHQYDVR0gBBYwFDAIBgYqhQNkcQEwCAYGKoUDZHECMDYGBSqFA2RvBC0M
KyLQmtGA0LjQv9GC0L7Qn9GA0L4gQ1NQIiAo0LLQtdGA0YHQuNGPIDMuNikwgdkGBSqFA2RwBIHP
MIHMDCsi0JrRgNC40L/RgtC+0J/RgNC+IENTUCIgKNCy0LXRgNGB0LjRjyAzLjYpDFMi0KPQtNC+
0YHRgtC+0LLQtdGA0Y/RjtGJ0LjQuSDRhtC10L3RgtGAICLQmtGA0LjQv9GC0L7Qn9GA0L4g0KPQ
piIg0LLQtdGA0YHQuNC4IDEuNQwj0KHQpC8xMjEtMTg1OSDQvtGCIDE3INC40Y7QvdGPIDIwMTIM
I9Ch0KQvMTI4LTE4MjIg0L7RgiAwMSDQuNGO0L3RjyAyMDEyMAgGBiqFAwICAwNBAB9h6kjYFTHS
exAgTVvZJ8odU/MiIBq0Oq0Pi0RBqOuWHC4oUJc+MXpziBUbie/sXzIYSXACFDQ5VQU+hZWhqEI=</wsse:BinarySecurityToken><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr34102001-gostr3411"/><ds:Reference URI="#body"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr3411"/><ds:DigestValue>wQqV7QAHB4Z/08bqaw4YwW1FsycmrS9rtDgTt8bNSQA=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>GPb7Tay2PoNOo9Z/YmdXgh+OAtedogh3kQj15Mm1lR4IPU5ogdJ4xTEvCPQebjAXhHuw7gc/QosN
Xe0eoWyLow==</ds:SignatureValue><ds:KeyInfo><wsse:SecurityTokenReference><wsse:Reference URI="#CertId" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></SOAP-ENV:Header>
	<SOAP-ENV:Body wsu:Id="body">
		<SOAP-WS:updateStatus xmlns:SOAP-WS="http://smev.gosuslugi.ru/rev120315">
			<smev:Message>
				<smev:Sender>
					<smev:Code>01HJ</smev:Code>
					<smev:Name>Вебдом ИС</smev:Name>
				</smev:Sender>
				<smev:Recipient>
					<smev:Code>PNZR01581</smev:Code>
					<smev:Name>Комплексная система предоставления государственных и
						муниципальных услуг Пензенской области
					</smev:Name>
				</smev:Recipient>
				<smev:ServiceName>PENZUniversalMVV</smev:ServiceName>
				<smev:TypeCode>GSRV</smev:TypeCode>
				<smev:Status>PING</smev:Status>
				<smev:Date>2014-12-17T01:29:31.866+03:00</smev:Date>
				<smev:ExchangeType>1</smev:ExchangeType>
				
				<smev:OriginRequestIdRef>04d268a0-9283-480f-9e8e-a99ccd964bf6</smev:OriginRequestIdRef>
			</smev:Message>
			<smev:MessageData>
				<smev:AppData>
					<oep:result xmlns:oep="http://oep-penza.ru/com/oep">
						<oep:dataRow>
							<oep:name>internalRequestId</oep:name>
							<oep:value>660</oep:value>
						</oep:dataRow>
					</oep:result>
				</smev:AppData>
			</smev:MessageData>
		</SOAP-WS:updateStatus>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>